[
    {
        "name": "Blotchy Textur",
        "glcm": "High contrast and low correlation between neighboring pixels due to irregular patches.",
        "lbp": "Random patterns with abrupt changes in intensity values, resulting in diverse local structures.",
        "gabor_filters": "Detected at various orientations with varying frequency responses, indicating irregular surface patterns.",
        "hog": "Gradual gradient changes, but overall a lack of dominant orientations.",
        "lpq": "Low phase congruency due to the lack of consistent structure.",
        "texture_energy": "High energy at certain frequencies, indicating rough and non-uniform texture.",
        "wavelet_transform": "Irregular frequency components across scales, highlighting uneven patterns.",
        "texton_histograms": "Various texton occurrences, reflecting the heterogeneous nature of the texture.",
        "haralick_features": "High contrast, low correlation, and low homogeneity, pointing to irregular and uneven patterns.",
        "local_phase_congruency": "Low phase congruency due to the absence of regular structures."
    },
    {
        "name": "Pitted Textur",
        "glcm": "Low contrast and high correlation between neighboring pixels due to the repetitive nature of pits.",
        "lbp": "Consistent circular patterns representing the presence of pits.",
        "gabor_filters": "Detected at various orientations with low frequency responses, indicating repetitive pit patterns.",
        "hog": "Dominant gradient orientations corresponding to pit edges.",
        "lpq": "High phase congruency due to the repeated pit structures.",
        "texture_energy": "Low energy at certain frequencies, indicating the presence of uniform pit patterns.",
        "wavelet_transform": "Concentrated energy at specific scales, representing repeated pit structures.",
        "texton_histograms": "High frequency of specific textons related to pit features.",
        "haralick_features": "Low contrast, high correlation, and high homogeneity, pointing to repetitive and uniform pit patterns.",
        "local_phase_congruency": "High phase congruency due to the regularity of pit structures."
    },
    {
        "name": "Striped Textur",
        "glcm": "High contrast and low correlation between neighboring pixels, indicating clear stripe patterns.",
        "lbp": "Regular patterns representing the presence of stripes.",
        "gabor_filters": "Detected at specific orientations and frequencies, highlighting the presence of stripes.",
        "hog": "Dominant gradient orientations corresponding to stripe directions.",
        "lpq": "Low phase congruency due to the regular and periodic nature of stripes.",
        "texture_energy": "High energy at certain frequencies, indicating the presence of distinct stripe patterns.",
        "wavelet_transform": "Concentrated energy at specific scales and orientations, representing the periodic stripe structures.",
        "texton_histograms": "High frequency of specific textons related to stripe features.",
        "haralick_features": "High contrast, low correlation, and low homogeneity, pointing to well-defined and distinct stripe patterns.",
        "local_phase_congruency": "Low phase congruency due to the regularity of stripe structures."
    },
    {
        "name": "Veined Textur",
        "glcm": "Moderate contrast and correlation, indicating the presence of linear vein patterns.",
        "lbp": "Sparse patterns representing the presence of veins with varying intensity changes.",
        "gabor_filters": "Detected at different orientations and frequencies, highlighting linear vein patterns.",
        "hog": "Multiple gradient orientations corresponding to the directions of veins.",
        "lpq": "Moderate phase congruency due to the linear nature of veins.",
        "texture_energy": "Moderate energy at certain frequencies, indicating the presence of linear vein structures.",
        "wavelet_transform": "Energy concentrated along specific orientations, representing the linear vein patterns.",
        "texton_histograms": "Moderate frequency of specific textons related to vein features.",
        "haralick_features": "Moderate contrast, correlation, and homogeneity, pointing to the presence of linear vein structures.",
        "local_phase_congruency": "Moderate phase congruency due to the presence of linear vein patterns."
    },
    {
        "name": "Woven Textur",
        "glcm": "High contrast and correlation between neighboring pixels due to regular weaving patterns.",
        "lbp": "Consistent patterns representing the presence of woven structures.",
        "gabor_filters": "Detected at specific orientations and frequencies, highlighting the woven patterns.",
        "hog": "Dominant gradient orientations corresponding to the directions of weaving.",
        "lpq": "High phase congruency due to the periodic nature of weaving.",
        "texture_energy": "Low energy at certain frequencies, indicating the presence of uniform woven patterns.",
        "wavelet_transform": "Concentrated energy at specific scales and orientations, representing the woven structures.",
        "texton_histograms": "High frequency of specific textons related to woven features.",
        "haralick_features": "Low contrast, high correlation, and high homogeneity, pointing to regular and uniform woven patterns.",
        "local_phase_congruency": "High phase congruency due to the regularity of woven structures."
    },
    {
        "name": "Scaly Textur",
        "glcm": "Moderate contrast and correlation, indicating the presence of repeating scales with varying orientations.",
        "lbp": "Consistent patterns representing the presence of scales with distinct local structures.",
        "gabor_filters": "Detected at specific orientations and frequencies, highlighting the presence of scaly patterns.",
        "hog": "Multiple gradient orientations corresponding to the directions of scales.",
        "lpq": "Moderate phase congruency due to the periodic nature of scales.",
        "texture_energy": "Low energy at certain frequencies, indicating the presence of uniform scaly patterns.",
        "wavelet_transform": "Energy concentrated along specific orientations, representing the repeating scaly structures.",
        "texton_histograms": "High frequency of specific textons related to scale features.",
        "haralick_features": "Moderate contrast, correlation, and homogeneity, pointing to the presence of scaly patterns.",
        "local_phase_congruency": "Moderate phase congruency due to the periodicity of scaly structures."
    },
    {
        "name": "Studded Textur",
        "glcm": "Low contrast and high correlation, indicating the presence of regularly spaced studs.",
        "lbp": "Consistent circular patterns representing the presence of studs with uniform intensity changes.",
        "gabor_filters": "Detected at specific orientations and frequencies, highlighting the presence of studded patterns.",
        "hog": "Dominant gradient orientations corresponding to the directions of studs.",
        "lpq": "High phase congruency due to the periodic arrangement of studs.",
        "texture_energy": "Low energy at certain frequencies, indicating the presence of uniform stud patterns.",
        "wavelet_transform": "Energy concentrated along specific orientations, representing the regularly spaced stud structures.",
        "texton_histograms": "High frequency of specific textons related to stud features.",
        "haralick_features": "Low contrast, high correlation, and high homogeneity, pointing to the presence of regularly spaced studs.",
        "local_phase_congruency": "High phase congruency due to the regularity of studded structures."
    },
    {
        "name": "Perforated Textur",
        "glcm": "Low contrast and high correlation, indicating the presence of regularly spaced perforations.",
        "lbp": "Consistent circular patterns representing the presence of perforations with uniform intensity changes.",
        "gabor_filters": "Detected at specific orientations and frequencies, highlighting the presence of perforated patterns.",
        "hog": "Dominant gradient orientations corresponding to the directions of perforations.",
        "lpq": "High phase congruency due to the periodic arrangement of perforations.",
        "texture_energy": "Low energy at certain frequencies, indicating the presence of uniform perforated patterns.",
        "wavelet_transform": "Energy concentrated along specific orientations, representing the regularly spaced perforation structures.",
        "texton_histograms": "High frequency of specific textons related to perforation features.",
        "haralick_features": "Low contrast, high correlation, and high homogeneity, pointing to the presence of regularly spaced perforations.",
        "local_phase_congruency": "High phase congruency due to the regularity of perforated structures."
    },
    {
        "name": "Freckled Textur",
        "glcm": "Low contrast and correlation, indicating the presence of randomly distributed freckles.",
        "lbp": "Sparse and scattered patterns representing the presence of freckles with varying intensity changes.",
        "gabor_filters": "Detected at various orientations with low frequency responses, indicating the presence of freckled patterns.",
        "hog": "Gradual gradient changes, but no dominant orientations due to the scattered nature of freckles.",
        "lpq": "Low phase congruency due to the irregular and scattered freckle structures.",
        "texture_energy": "High energy at certain frequencies, indicating the presence of non-uniform freckled patterns.",
        "wavelet_transform": "Irregular frequency components across scales, highlighting the scattered freckle structures.",
        "texton_histograms": "Various texton occurrences, reflecting the heterogeneous nature of freckle patterns.",
        "haralick_features": "Low contrast, low correlation, and low homogeneity, pointing to the irregular and scattered freckle patterns.",
        "local_phase_congruency": "Low phase congruency due to the lack of consistent structure in freckles."
    },
    {
        "name": "Fibrous Textur",
        "glcm": "Moderate contrast and correlation, indicating the presence of elongated and interconnected fibers.",
        "lbp": "Sparse and elongated patterns representing the presence of fibrous structures.",
        "gabor_filters": "Detected at specific orientations and frequencies, highlighting the presence of fibrous patterns.",
        "hog": "Dominant gradient orientations corresponding to the directions of fibers.",
        "lpq": "Low phase congruency due to the elongated and unidirectional nature of fibers.",
        "texture_energy": "Low energy at certain frequencies, indicating the presence of uniform fibrous patterns.",
        "wavelet_transform": "Energy concentrated along specific orientations, representing the elongated fiber structures.",
        "texton_histograms": "High frequency of specific textons related to fibrous features.",
        "haralick_features": "Moderate contrast, correlation, and homogeneity, pointing to the presence of fibrous patterns.",
        "local_phase_congruency": "Low phase congruency due to the unidirectional and elongated fibers."
    },
    {
        "name": "Bubbly Textur",
        "glcm": "Low contrast and correlation, indicating the presence of scattered and irregular bubbles or voids.",
        "lbp": "Sparse and scattered patterns representing the presence of bubbles with varying intensity changes.",
        "gabor_filters": "Detected at various orientations with low frequency responses, indicating the presence of bubbly patterns.",
        "hog": "Gradual gradient changes, but no dominant orientations due to the scattered nature of bubbles.",
        "lpq": "Low phase congruency due to the irregular and scattered bubbly structures.",
        "texture_energy": "High energy at certain frequencies, indicating the presence of non-uniform bubbly patterns.",
        "wavelet_transform": "Irregular frequency components across scales, highlighting the scattered bubbly structures.",
        "texton_histograms": "Various texton occurrences, reflecting the heterogeneous nature of bubbly patterns.",
        "haralick_features": "Low contrast, low correlation, and low homogeneity, pointing to the irregular and scattered bubbly patterns.",
        "local_phase_congruency": "Low phase congruency due to the lack of consistent structure in bubbles."
    },
    {
        "name": "Porous Textur",
        "glcm": "Moderate contrast and correlation, indicating the presence of interconnected pores with varying sizes and shapes.",
        "lbp": "Sparse and irregular patterns representing the presence of pores with diverse local structures.",
        "gabor_filters": "Detected at various orientations and frequencies, highlighting the presence of porous patterns.",
        "hog": "Gradual gradient changes, but no dominant orientations due to the irregularity of pores.",
        "lpq": "Low phase congruency due to the irregular and interconnected nature of pores.",
        "texture_energy": "High energy at certain frequencies, indicating the presence of non-uniform porous patterns.",
        "wavelet_transform": "Irregular frequency components across scales, highlighting the interconnected porous structures.",
        "texton_histograms": "Various texton occurrences, reflecting the heterogeneous nature of porous patterns.",
        "haralick_features": "Moderate contrast, correlation, and homogeneity, pointing to the presence of porous structures.",
        "local_phase_congruency": "Low phase congruency due to the irregular and interconnected nature of pores."
    },
    {
        "name": "Stratified Textur",
        "glcm": "High contrast and correlation, indicating the presence of layered or stratified structures.",
        "lbp": "Regular patterns representing the presence of well-defined layers or strata.",
        "gabor_filters": "Detected at specific orientations and frequencies, highlighting the presence of stratified patterns.",
        "hog": "Dominant gradient orientations corresponding to the layering directions.",
        "lpq": "High phase congruency due to the periodic arrangement of layers.",
        "texture_energy": "Low energy at certain frequencies, indicating the presence of uniform stratified patterns.",
        "wavelet_transform": "Energy concentrated along specific orientations, representing the layered stratified structures.",
        "texton_histograms": "High frequency of specific textons related to stratified features.",
        "haralick_features": "High contrast, correlation, and homogeneity, pointing to well-defined and distinct stratified patterns.",
        "local_phase_congruency": "High phase congruency due to the regularity of stratified structures."
    },
    {
        "name": "Cobwebbed Textur",
        "glcm": "Low contrast and correlation, indicating the presence of intricate and delicate cobweb patterns.",
        "lbp": "Sparse and interconnected patterns representing the presence of cobweb structures with unique local features.",
        "gabor_filters": "Detected at various orientations and frequencies, highlighting the presence of cobwebbed patterns.",
        "hog": "Gradual gradient changes with no dominant orientations due to the intricate nature of cobwebs.",
        "lpq": "Low phase congruency due to the complex and interconnected cobweb structures.",
        "texture_energy": "High energy at certain frequencies, indicating the presence of intricate and non-uniform cobweb patterns.",
        "wavelet_transform": "Irregular frequency components across scales, highlighting the delicate cobweb structures.",
        "texton_histograms": "Various texton occurrences, reflecting the heterogeneous nature of cobweb patterns.",
        "haralick_features": "Low contrast, low correlation, and low homogeneity, pointing to the complex and interconnected cobweb patterns.",
        "local_phase_congruency": "Low phase congruency due to the intricate and delicate nature of cobweb structures."
    },
    {
        "name": "Potholed Textur",
        "glcm": "High contrast and correlation, indicating the presence of irregularly distributed and deep potholes.",
        "lbp": "Random and scattered patterns representing the presence of potholes with abrupt intensity changes.",
        "gabor_filters": "Detected at various orientations and frequencies, highlighting the presence of potholed patterns.",
        "hog": "Gradual gradient changes with no dominant orientations due to the scattered nature of potholes.",
        "lpq": "Low phase congruency due to the irregular and scattered pothole structures.",
        "texture_energy": "High energy at certain frequencies, indicating the presence of non-uniform and rough potholed patterns.",
        "wavelet_transform": "Irregular frequency components across scales, highlighting the scattered pothole structures.",
        "texton_histograms": "Various texton occurrences, reflecting the heterogeneous nature of potholed patterns.",
        "haralick_features": "High contrast, correlation, and homogeneity, pointing to the presence of irregular and deep pothole structures.",
        "local_phase_congruency": "Low phase congruency due to the lack of consistent structure in potholes."
    },
    {
        "name": "Bumpy Textur",
        "glcm": "Moderate contrast and correlation, indicating the presence of irregular and rough bumps.",
        "lbp": "Random and scattered patterns representing the presence of bumps with abrupt intensity changes.",
        "gabor_filters": "Detected at various orientations and frequencies, highlighting the presence of bumpy patterns.",
        "hog": "Gradual gradient changes with no dominant orientations due to the irregularity of bumps.",
        "lpq": "Low phase congruency due to the irregular and scattered bumpy structures.",
        "texture_energy": "High energy at certain frequencies, indicating the presence of non-uniform and rough bumpy patterns.",
        "wavelet_transform": "Irregular frequency components across scales, highlighting the scattered bumpy structures.",
        "texton_histograms": "Various texton occurrences, reflecting the heterogeneous nature of bumpy patterns.",
        "haralick_features": "Moderate contrast, correlation, and homogeneity, pointing to the presence of irregular and rough bump structures.",
        "local_phase_congruency": "Low phase congruency due to the lack of consistent structure in bumps."
    },
    {
        "name": "Lacelike Textur",
        "glcm": "Low contrast and correlation, indicating the presence of intricate and delicate lace patterns.",
        "lbp": "Sparse and interconnected patterns representing the presence of lace structures with unique local features.",
        "gabor_filters": "Detected at various orientations and frequencies, highlighting the presence of lacelike patterns.",
        "hog": "Gradual gradient changes with no dominant orientations due to the intricate nature of lace.",
        "lpq": "Low phase congruency due to the complex and interconnected lace structures.",
        "texture_energy": "High energy at certain frequencies, indicating the presence of intricate and non-uniform lacelike patterns.",
        "wavelet_transform": "Irregular frequency components across scales, highlighting the delicate lace structures.",
        "texton_histograms": "Various texton occurrences, reflecting the heterogeneous nature of lacelike patterns.",
        "haralick_features": "Low contrast, low correlation, and low homogeneity, pointing to the complex and interconnected lace patterns.",
        "local_phase_congruency": "Low phase congruency due to the intricate and delicate nature of lace structures."
    },
    {
        "name": "Spiralled Textur",
        "glcm": "High contrast and correlation, indicating the presence of tightly wound and spiral-like patterns.",
        "lbp": "Consistent patterns representing the presence of spirals with distinct local structures.",
        "gabor_filters": "Detected at specific orientations and frequencies, highlighting the presence of spiralled patterns.",
        "hog": "Dominant gradient orientations corresponding to the directions of spirals.",
        "lpq": "High phase congruency due to the periodic arrangement of spirals.",
        "texture_energy": "Low energy at certain frequencies, indicating the presence of uniform spiralled patterns.",
        "wavelet_transform": "Energy concentrated along specific orientations, representing the tightly wound spiral structures.",
        "texton_histograms": "High frequency of specific textons related to spiral features.",
        "haralick_features": "High contrast, low correlation, and low homogeneity, pointing to the presence of tightly wound and spiral-like patterns.",
        "local_phase_congruency": "High phase congruency due to the regularity of spiralled structures."
    },
    {
        "name": "Waffled Textur",
        "glcm": "Moderate contrast and correlation, indicating the presence of repetitive and interconnected waffle-like patterns.",
        "lbp": "Consistent and square-like patterns representing the presence of waffle structures.",
        "gabor_filters": "Detected at specific orientations and frequencies, highlighting the presence of waffled patterns.",
        "hog": "Dominant gradient orientations corresponding to the directions of waffles.",
        "lpq": "Moderate phase congruency due to the periodic arrangement of waffle structures.",
        "texture_energy": "Low energy at certain frequencies, indicating the presence of uniform waffled patterns.",
        "wavelet_transform": "Energy concentrated along specific orientations, representing the repetitive waffle structures.",
        "texton_histograms": "High frequency of specific textons related to waffle features.",
        "haralick_features": "Moderate contrast, correlation, and homogeneity, pointing to the presence of repetitive and interconnected waffled patterns.",
        "local_phase_congruency": "Moderate phase congruency due to the periodicity of waffled structures."
    },
    {
        "name": "Stained Textur",
        "glcm": "Moderate contrast and correlation, indicating the presence of irregular and scattered stains.",
        "lbp": "Random and scattered patterns representing the presence of stains with varying intensity changes.",
        "gabor_filters": "Detected at various orientations and frequencies, highlighting the presence of stained patterns.",
        "hog": "Gradual gradient changes with no dominant orientations due to the scattered nature of stains.",
        "lpq": "Low phase congruency due to the irregular and scattered stain structures.",
        "texture_energy": "High energy at certain frequencies, indicating the presence of non-uniform and irregular stained patterns.",
        "wavelet_transform": "Irregular frequency components across scales, highlighting the scattered stained structures.",
        "texton_histograms": "Various texton occurrences, reflecting the heterogeneous nature of stained patterns.",
        "haralick_features": "Moderate contrast, correlation, and homogeneity, pointing to the presence of irregular and scattered stained structures.",
        "local_phase_congruency": "Low phase congruency due to the lack of consistent structure in stains."
    },
    {
        "name": "Marbled Textur",
        "glcm": "Moderate contrast and correlation, indicating the presence of swirling and interconnected marble-like patterns.",
        "lbp": "Consistent and circular patterns representing the presence of marbled structures.",
        "gabor_filters": "Detected at specific orientations and frequencies, highlighting the presence of marbled patterns.",
        "hog": "Dominant gradient orientations corresponding to the directions of marble swirls.",
        "lpq": "Moderate phase congruency due to the periodic arrangement of marbled structures.",
        "texture_energy": "Low energy at certain frequencies, indicating the presence of uniform marbled patterns.",
        "wavelet_transform": "Energy concentrated along specific orientations, representing the swirling marble structures.",
        "texton_histograms": "High frequency of specific textons related to marble features.",
        "haralick_features": "Moderate contrast, correlation, and homogeneity, pointing to the presence of swirling and interconnected marbled patterns.",
        "local_phase_congruency": "Moderate phase congruency due to the periodicity of marbled structures."
    },
    {
        "name": "Braided Textur",
        "glcm": "High contrast and correlation, indicating the presence of intertwined and repetitive braids or strands.",
        "lbp": "Consistent patterns representing the presence of braided structures with distinct local features.",
        "gabor_filters": "Detected at specific orientations and frequencies, highlighting the presence of braided patterns.",
        "hog": "Dominant gradient orientations corresponding to the directions of braids.",
        "lpq": "High phase congruency due to the periodic arrangement of braided structures.",
        "texture_energy": "Low energy at certain frequencies, indicating the presence of uniform braided patterns.",
        "wavelet_transform": "Energy concentrated along specific orientations, representing the intertwined braided structures.",
        "texton_histograms": "High frequency of specific textons related to braided features.",
        "haralick_features": "High contrast, low correlation, and low homogeneity, pointing to the presence of intertwined and repetitive braided patterns.",
        "local_phase_congruency": "High phase congruency due to the regularity of braided structures."
    },
    {
        "name": "Polka-dotted Textur",
        "glcm": "Low contrast and correlation, indicating the presence of scattered and regular polka dots.",
        "lbp": "Consistent circular patterns representing the presence of polka dots with distinct local structures.",
        "gabor_filters": "Detected at specific orientations and frequencies, highlighting the presence of polka-dotted patterns.",
        "hog": "Dominant gradient orientations corresponding to the directions of polka dots.",
        "lpq": "Low phase congruency due to the scattered and regular nature of polka dots.",
        "texture_energy": "Low energy at certain frequencies, indicating the presence of uniform polka-dotted patterns.",
        "wavelet_transform": "Energy concentrated along specific orientations, representing the scattered polka-dotted structures.",
        "texton_histograms": "High frequency of specific textons related to polka dot features.",
        "haralick_features": "Low contrast, low correlation, and low homogeneity, pointing to the scattered and regular polka-dotted patterns.",
        "local_phase_congruency": "Low phase congruency due to the regularity of polka dots."
    },
    {
        "name": "Matted Textur",
        "glcm": "Low contrast and correlation, indicating the presence of tangled and rough matted patterns.",
        "lbp": "Random and scattered patterns representing the presence of tangled structures with abrupt intensity changes.",
        "gabor_filters": "Detected at various orientations and frequencies, highlighting the presence of matted patterns.",
        "hog": "Gradual gradient changes with no dominant orientations due to the tangled nature of matted textures.",
        "lpq": "Low phase congruency due to the irregular and rough matted structures.",
        "texture_energy": "High energy at certain frequencies, indicating the presence of non-uniform and tangled matted patterns.",
        "wavelet_transform": "Irregular frequency components across scales, highlighting the tangled matted structures.",
        "texton_histograms": "Various texton occurrences, reflecting the heterogeneous nature of matted patterns.",
        "haralick_features": "Low contrast, low correlation, and low homogeneity, pointing to the rough and tangled matted textures.",
        "local_phase_congruency": "Low phase congruency due to the lack of consistent structure in matted textures."
    },
    {
        "name": "Chequered Textur",
        "glcm": "High contrast and correlation, indicating the presence of regularly spaced and interlocking squares or checks.",
        "lbp": "Consistent and square-like patterns representing the presence of chequered structures.",
        "gabor_filters": "Detected at specific orientations and frequencies, highlighting the presence of chequered patterns.",
        "hog": "Dominant gradient orientations corresponding to the directions of checks.",
        "lpq": "High phase congruency due to the periodic arrangement of chequered structures.",
        "texture_energy": "Low energy at certain frequencies, indicating the presence of uniform chequered patterns.",
        "wavelet_transform": "Energy concentrated along specific orientations, representing the interlocking chequered structures.",
        "texton_histograms": "High frequency of specific textons related to chequered features.",
        "haralick_features": "High contrast, correlation, and homogeneity, pointing to well-defined and distinct chequered patterns.",
        "local_phase_congruency": "High phase congruency due to the regularity of chequered structures."
    },
    {
        "name": "Crystalline Textur",
        "glcm": "High contrast and correlation, indicating the presence of regular and repeating crystalline patterns.",
        "lbp": "Consistent and angular patterns representing the presence of crystalline structures.",
        "gabor_filters": "Detected at specific orientations and frequencies, highlighting the presence of crystalline patterns.",
        "hog": "Dominant gradient orientations corresponding to the directions of crystalline structures.",
        "lpq": "High phase congruency due to the periodic arrangement of crystalline patterns.",
        "texture_energy": "Low energy at certain frequencies, indicating the presence of uniform crystalline patterns.",
        "wavelet_transform": "Energy concentrated along specific orientations, representing the repeating crystalline structures.",
        "texton_histograms": "High frequency of specific textons related to crystalline features.",
        "haralick_features": "High contrast, correlation, and homogeneity, pointing to well-defined and distinct crystalline patterns.",
        "local_phase_congruency": "High phase congruency due to the regularity of crystalline structures."
    },
    {
        "name": "Gauzy Textur",
        "glcm": "Low contrast and correlation, indicating the presence of translucent and delicate gauzy patterns.",
        "lbp": "Sparse and interconnected patterns representing the presence of gauzy structures with unique local features.",
        "gabor_filters": "Detected at various orientations and frequencies, highlighting the presence of gauzy patterns.",
        "hog": "Gradual gradient changes with no dominant orientations due to the delicate nature of gauze.",
        "lpq": "Low phase congruency due to the complex and interconnected gauzy structures.",
        "texture_energy": "High energy at certain frequencies, indicating the presence of translucent and non-uniform gauzy patterns.",
        "wavelet_transform": "Irregular frequency components across scales, highlighting the delicate gauzy structures.",
        "texton_histograms": "Various texton occurrences, reflecting the heterogeneous nature of gauzy patterns.",
        "haralick_features": "Low contrast, low correlation, and low homogeneity, pointing to the delicate and interconnected gauzy patterns.",
        "local_phase_congruency": "Low phase congruency due to the intricate and delicate nature of gauzy structures."
    },
    {
        "name": "Dotted Textur",
        "glcm": "Low contrast and correlation, indicating the presence of scattered and regular dots.",
        "lbp": "Consistent circular patterns representing the presence of dots with distinct local structures.",
        "gabor_filters": "Detected at specific orientations and frequencies, highlighting the presence of dotted patterns.",
        "hog": "Dominant gradient orientations corresponding to the directions of dots.",
        "lpq": "Low phase congruency due to the scattered and regular nature of dots.",
        "texture_energy": "Low energy at certain frequencies, indicating the presence of uniform dotted patterns.",
        "wavelet_transform": "Energy concentrated along specific orientations, representing the scattered dotted structures.",
        "texton_histograms": "High frequency of specific textons related to dot features.",
        "haralick_features": "Low contrast, low correlation, and low homogeneity, pointing to the scattered and regular dotted patterns.",
        "local_phase_congruency": "Low phase congruency due to the regularity of dots."
    },
    {
        "name": "Knitted Textur",
        "glcm": "Moderate contrast and correlation, indicating the presence of interconnected and repetitive knitted patterns.",
        "lbp": "Consistent and square-like patterns representing the presence of knitted structures.",
        "gabor_filters": "Detected at specific orientations and frequencies, highlighting the presence of knitted patterns.",
        "hog": "Dominant gradient orientations corresponding to the directions of knitting.",
        "lpq": "Moderate phase congruency due to the periodic arrangement of knitted structures.",
        "texture_energy": "Low energy at certain frequencies, indicating the presence of uniform knitted patterns.",
        "wavelet_transform": "Energy concentrated along specific orientations, representing the interconnected knitted structures.",
        "texton_histograms": "High frequency of specific textons related to knitting features.",
        "haralick_features": "Moderate contrast, correlation, and homogeneity, pointing to the presence of repetitive and interconnected knitted patterns.",
        "local_phase_congruency": "Moderate phase congruency due to the periodicity of knitted structures."
    },
    {
        "name": "Wrinkled Textur",
        "glcm": "Low contrast and correlation, indicating the presence of irregular and wrinkled patterns.",
        "lbp": "Random and scattered patterns representing the presence of wrinkles with abrupt intensity changes.",
        "gabor_filters": "Detected at various orientations and frequencies, highlighting the presence of wrinkled patterns.",
        "hog": "Gradual gradient changes with no dominant orientations due to the irregularity of wrinkles.",
        "lpq": "Low phase congruency due to the irregular and rough wrinkled structures.",
        "texture_energy": "High energy at certain frequencies, indicating the presence of non-uniform and rough wrinkled patterns.",
        "wavelet_transform": "Irregular frequency components across scales, highlighting the wrinkled structures.",
        "texton_histograms": "Various texton occurrences, reflecting the heterogeneous nature of wrinkled patterns.",
        "haralick_features": "Low contrast, low correlation, and low homogeneity, pointing to the irregular and rough wrinkled textures.",
        "local_phase_congruency": "Low phase congruency due to the lack of consistent structure in wrinkles."
    },
    {
        "name": "Lined Textur",
        "glcm": "High contrast and correlation, indicating the presence of regularly spaced and parallel lines or stripes.",
        "lbp": "Consistent linear patterns representing the presence of lined structures.",
        "gabor_filters": "Detected at specific orientations and frequencies, highlighting the presence of lined patterns.",
        "hog": "Dominant gradient orientations corresponding to the directions of lines.",
        "lpq": "High phase congruency due to the periodic arrangement of lined structures.",
        "texture_energy": "Low energy at certain frequencies, indicating the presence of uniform lined patterns.",
        "wavelet_transform": "Energy concentrated along specific orientations, representing the parallel lined structures.",
        "texton_histograms": "High frequency of specific textons related to lined features.",
        "haralick_features": "High contrast, correlation, and homogeneity, pointing to well-defined and distinct lined patterns.",
        "local_phase_congruency": "High phase congruency due to the regularity of lined structures."
    },
    {
        "name": "Honeycombed Textur",
        "glcm": "High contrast and correlation, indicating the presence of regular and repeating honeycomb-like patterns.",
        "lbp": "Consistent and hexagonal patterns representing the presence of honeycombed structures.",
        "gabor_filters": "Detected at specific orientations and frequencies, highlighting the presence of honeycombed patterns.",
        "hog": "Dominant gradient orientations corresponding to the directions of honeycomb patterns.",
        "lpq": "High phase congruency due to the periodic arrangement of honeycombed structures.",
        "texture_energy": "Low energy at certain frequencies, indicating the presence of uniform honeycombed patterns.",
        "wavelet_transform": "Energy concentrated along specific orientations, representing the repeating honeycomb structures.",
        "texton_histograms": "High frequency of specific textons related to honeycomb features.",
        "haralick_features": "High contrast, correlation, and homogeneity, pointing to well-defined and distinct honeycombed patterns.",
        "local_phase_congruency": "High phase congruency due to the regularity of honeycombed structures."
    },
    {
        "name": "Sprinkled Textur",
        "glcm": "Low contrast and correlation, indicating the presence of randomly scattered sprinkles or spots.",
        "lbp": "Random and scattered patterns representing the presence of sprinkled structures with abrupt intensity changes.",
        "gabor_filters": "Detected at various orientations and frequencies, highlighting the presence of sprinkled patterns.",
        "hog": "Gradual gradient changes with no dominant orientations due to the scattered nature of sprinkles.",
        "lpq": "Low phase congruency due to the irregular and scattered sprinkled structures.",
        "texture_energy": "High energy at certain frequencies, indicating the presence of non-uniform and scattered sprinkled patterns.",
        "wavelet_transform": "Irregular frequency components across scales, highlighting the scattered sprinkled structures.",
        "texton_histograms": "Various texton occurrences, reflecting the heterogeneous nature of sprinkled patterns.",
        "haralick_features": "Low contrast, low correlation, and low homogeneity, pointing to the irregular and scattered sprinkled textures.",
        "local_phase_congruency": "Low phase congruency due to the lack of consistent structure in sprinkles."
    },
    {
        "name": "Frilly Textur",
        "glcm": "Low contrast and correlation, indicating the presence of delicate and intricate frilly patterns.",
        "lbp": "Sparse and interconnected patterns representing the presence of frilly structures with unique local features.",
        "gabor_filters": "Detected at various orientations and frequencies, highlighting the presence of frilly patterns.",
        "hog": "Gradual gradient changes with no dominant orientations due to the intricate nature of frills.",
        "lpq": "Low phase congruency due to the complex and interconnected frilly structures.",
        "texture_energy": "High energy at certain frequencies, indicating the presence of delicate and non-uniform frilly patterns.",
        "wavelet_transform": "Irregular frequency components across scales, highlighting the delicate frilly structures.",
        "texton_histograms": "Various texton occurrences, reflecting the heterogeneous nature of frilly patterns.",
        "haralick_features": "Low contrast, low correlation, and low homogeneity, pointing to the intricate and delicate frilly patterns.",
        "local_phase_congruency": "Low phase congruency due to the intricate and delicate nature of frilly structures."
    },
    {
        "name": "Cracked Textur",
        "glcm": "High contrast and correlation, indicating the presence of irregular and fractured cracks or fissures.",
        "lbp": "Random and scattered patterns representing the presence of cracks with abrupt intensity changes.",
        "gabor_filters": "Detected at various orientations and frequencies, highlighting the presence of cracked patterns.",
        "hog": "Gradual gradient changes with no dominant orientations due to the irregularity of cracks.",
        "lpq": "Low phase congruency due to the irregular and rough cracked structures.",
        "texture_energy": "High energy at certain frequencies, indicating the presence of non-uniform and rough cracked patterns.",
        "wavelet_transform": "Irregular frequency components across scales, highlighting the cracked structures.",
        "texton_histograms": "Various texton occurrences, reflecting the heterogeneous nature of cracked patterns.",
        "haralick_features": "High contrast, correlation, and homogeneity, pointing to the presence of irregular and fractured cracks.",
        "local_phase_congruency": "Low phase congruency due to the lack of consistent structure in cracks."
    },
    {
        "name": "Banded Textur",
        "glcm": "High contrast and correlation, indicating the presence of regularly spaced and parallel bands or stripes.",
        "lbp": "Consistent linear patterns representing the presence of banded structures.",
        "gabor_filters": "Detected at specific orientations and frequencies, highlighting the presence of banded patterns.",
        "hog": "Dominant gradient orientations corresponding to the directions of bands.",
        "lpq": "High phase congruency due to the periodic arrangement of banded structures.",
        "texture_energy": "Low energy at certain frequencies, indicating the presence of uniform banded patterns.",
        "wavelet_transform": "Energy concentrated along specific orientations, representing the parallel banded structures.",
        "texton_histograms": "High frequency of specific textons related to banded features.",
        "haralick_features": "High contrast, correlation, and homogeneity, pointing to well-defined and distinct banded patterns.",
        "local_phase_congruency": "High phase congruency due to the regularity of banded structures."
    },
    {
        "name": "Flecked Textur",
        "glcm": "Low contrast and correlation, indicating the presence of randomly scattered and irregular flecks or spots.",
        "lbp": "Random and scattered patterns representing the presence of flecked structures with abrupt intensity changes.",
        "gabor_filters": "Detected at various orientations and frequencies, highlighting the presence of flecked patterns.",
        "hog": "Gradual gradient changes with no dominant orientations due to the scattered nature of flecks.",
        "lpq": "Low phase congruency due to the irregular and scattered flecked structures.",
        "texture_energy": "High energy at certain frequencies, indicating the presence of non-uniform and scattered flecked patterns.",
        "wavelet_transform": "Irregular frequency components across scales, highlighting the scattered flecked structures.",
        "texton_histograms": "Various texton occurrences, reflecting the heterogeneous nature of flecked patterns.",
        "haralick_features": "Low contrast, low correlation, and low homogeneity, pointing to the irregular and scattered flecked textures.",
        "local_phase_congruency": "Low phase congruency due to the lack of consistent structure in flecks."
    },
    {
        "name": "Pleated Textur",
        "glcm": "Moderate contrast and correlation, indicating the presence of regularly spaced and parallel pleats or folds.",
        "lbp": "Consistent linear patterns representing the presence of pleated structures.",
        "gabor_filters": "Detected at specific orientations and frequencies, highlighting the presence of pleated patterns.",
        "hog": "Dominant gradient orientations corresponding to the directions of pleats.",
        "lpq": "Moderate phase congruency due to the periodic arrangement of pleated structures.",
        "texture_energy": "Low energy at certain frequencies, indicating the presence of uniform pleated patterns.",
        "wavelet_transform": "Energy concentrated along specific orientations, representing the parallel pleated structures.",
        "texton_histograms": "High frequency of specific textons related to pleated features.",
        "haralick_features": "Moderate contrast, correlation, and homogeneity, pointing to the presence of regularly spaced and parallel pleats.",
        "local_phase_congruency": "Moderate phase congruency due to the periodicity of pleated structures."
    },
    {
        "name": "Smeared Textur",
        "glcm": "Low contrast and correlation, indicating the presence of irregular and smudged patterns.",
        "lbp": "Random and scattered patterns representing the presence of smears with abrupt intensity changes.",
        "gabor_filters": "Detected at various orientations and frequencies, highlighting the presence of smeared patterns.",
        "hog": "Gradual gradient changes with no dominant orientations due to the irregularity of smears.",
        "lpq": "Low phase congruency due to the irregular and rough smeared structures.",
        "texture_energy": "High energy at certain frequencies, indicating the presence of non-uniform and rough smeared patterns.",
        "wavelet_transform": "Irregular frequency components across scales, highlighting the smeared structures.",
        "texton_histograms": "Various texton occurrences, reflecting the heterogeneous nature of smeared patterns.",
        "haralick_features": "Low contrast, low correlation, and low homogeneity, pointing to the irregular and smudged textures.",
        "local_phase_congruency": "Low phase congruency due to the lack of consistent structure in smears."
    },
    {
        "name": "Grid Textur",
        "glcm": "High contrast and correlation, indicating the presence of regular and repeating grid-like patterns.",
        "lbp": "Consistent and rectangular patterns representing the presence of grid structures.",
        "gabor_filters": "Detected at specific orientations and frequencies, highlighting the presence of grid patterns.",
        "hog": "Dominant gradient orientations corresponding to the directions of the grid lines.",
        "lpq": "High phase congruency due to the periodic arrangement of grid structures.",
        "texture_energy": "Low energy at certain frequencies, indicating the presence of uniform grid patterns.",
        "wavelet_transform": "Energy concentrated along specific orientations, representing the repeating grid structures.",
        "texton_histograms": "High frequency of specific textons related to grid features.",
        "haralick_features": "High contrast, correlation, and homogeneity, pointing to well-defined and distinct grid patterns.",
        "local_phase_congruency": "High phase congruency due to the regularity of grid structures."
    },
    {
        "name": "Meshed Textur",
        "glcm": "High contrast and correlation, indicating the presence of regular and interconnected mesh-like patterns.",
        "lbp": "Consistent and hexagonal patterns representing the presence of meshed structures.",
        "gabor_filters": "Detected at specific orientations and frequencies, highlighting the presence of meshed patterns.",
        "hog": "Dominant gradient orientations corresponding to the directions of mesh lines.",
        "lpq": "High phase congruency due to the periodic arrangement of meshed structures.",
        "texture_energy": "Low energy at certain frequencies, indicating the presence of uniform meshed patterns.",
        "wavelet_transform": "Energy concentrated along specific orientations, representing the interconnected mesh structures.",
        "texton_histograms": "High frequency of specific textons related to mesh features.",
        "haralick_features": "High contrast, correlation, and homogeneity, pointing to well-defined and distinct meshed patterns.",
        "local_phase_congruency": "High phase congruency due to the regularity of meshed structures."
    },
    {
        "name": "Interlaced Textur",
        "glcm": "High contrast and correlation, indicating the presence of interwoven and regular interlaced patterns.",
        "lbp": "Consistent and intertwined patterns representing the presence of interlaced structures.",
        "gabor_filters": "Detected at specific orientations and frequencies, highlighting the presence of interlaced patterns.",
        "hog": "Dominant gradient orientations corresponding to the directions of interlaced lines.",
        "lpq": "High phase congruency due to the periodic arrangement of interlaced structures.",
        "texture_energy": "Low energy at certain frequencies, indicating the presence of uniform interlaced patterns.",
        "wavelet_transform": "Energy concentrated along specific orientations, representing the interwoven interlaced structures.",
        "texton_histograms": "High frequency of specific textons related to interlaced features.",
        "haralick_features": "High contrast, correlation, and homogeneity, pointing to well-defined and distinct interlaced patterns.",
        "local_phase_congruency": "High phase congruency due to the regularity of interlaced structures."
    },
    {
        "name": "Swirly Textur",
        "glcm": "Low contrast and correlation, indicating the presence of swirling and irregular patterns.",
        "lbp": "Sparse and interconnected patterns representing the presence of swirly structures with unique local features.",
        "gabor_filters": "Detected at various orientations and frequencies, highlighting the presence of swirly patterns.",
        "hog": "Gradual gradient changes with no dominant orientations due to the swirling nature of swirly textures.",
        "lpq": "Low phase congruency due to the complex and interconnected swirly structures.",
        "texture_energy": "High energy at certain frequencies, indicating the presence of swirling and non-uniform swirly patterns.",
        "wavelet_transform": "Irregular frequency components across scales, highlighting the swirling swirly structures.",
        "texton_histograms": "Various texton occurrences, reflecting the heterogeneous nature of swirly patterns.",
        "haralick_features": "Low contrast, low correlation, and low homogeneity, pointing to the swirling and interconnected swirly patterns.",
        "local_phase_congruency": "Low phase congruency due to the intricate and swirling nature of swirly structures."
    },
    {
        "name": "Grooved Textur",
        "glcm": "High contrast and correlation, indicating the presence of regularly spaced and parallel grooves or ridges.",
        "lbp": "Consistent linear patterns representing the presence of grooved structures.",
        "gabor_filters": "Detected at specific orientations and frequencies, highlighting the presence of grooved patterns.",
        "hog": "Dominant gradient orientations corresponding to the directions of grooves.",
        "lpq": "High phase congruency due to the periodic arrangement of grooved structures.",
        "texture_energy": "Low energy at certain frequencies, indicating the presence of uniform grooved patterns.",
        "wavelet_transform": "Energy concentrated along specific orientations, representing the parallel grooved structures.",
        "texton_histograms": "High frequency of specific textons related to grooved features.",
        "haralick_features": "High contrast, correlation, and homogeneity, pointing to well-defined and distinct grooved patterns.",
        "local_phase_congruency": "High phase congruency due to the regularity of grooved structures."
    },
    {
        "name": "Crosshatched Textur",
        "glcm": "High contrast and correlation, indicating the presence of regular and repeating crosshatch patterns.",
        "lbp": "Consistent and intersecting patterns representing the presence of crosshatched structures.",
        "gabor_filters": "Detected at specific orientations and frequencies, highlighting the presence of crosshatched patterns.",
        "hog": "Dominant gradient orientations corresponding to the directions of crosshatch lines.",
        "lpq": "High phase congruency due to the periodic arrangement of crosshatched structures.",
        "texture_energy": "Low energy at certain frequencies, indicating the presence of uniform crosshatched patterns.",
        "wavelet_transform": "Energy concentrated along specific orientations, representing the repeating crosshatch structures.",
        "texton_histograms": "High frequency of specific textons related to crosshatched features.",
        "haralick_features": "High contrast, correlation, and homogeneity, pointing to well-defined and distinct crosshatched patterns.",
        "local_phase_congruency": "High phase congruency due to the regularity of crosshatched structures."
    },
    {
        "name": "Zigzagged Textur",
        "glcm": "Low contrast and correlation, indicating the presence of irregular and zigzag patterns.",
        "lbp": "Sparse and interconnected patterns representing the presence of zigzag structures with unique local features.",
        "gabor_filters": "Detected at various orientations and frequencies, highlighting the presence of zigzag patterns.",
        "hog": "Gradual gradient changes with no dominant orientations due to the zigzag nature of textures.",
        "lpq": "Low phase congruency due to the complex and interconnected zigzagged structures.",
        "texture_energy": "High energy at certain frequencies, indicating the presence of zigzagged and non-uniform patterns.",
        "wavelet_transform": "Irregular frequency components across scales, highlighting the zigzagged structures.",
        "texton_histograms": "Various texton occurrences, reflecting the heterogeneous nature of zigzagged patterns.",
        "haralick_features": "Low contrast, low correlation, and low homogeneity, pointing to the zigzagged and interconnected structures.",
        "local_phase_congruency": "Low phase congruency due to the intricate and zigzag nature of structures."
    }
]